# Pandas  
__import pandas as pd  , pd.Series([ ],index=[ ] ) , pd.DataFrame([ ], index=[ ], columns=[ ] )__

- Series, DataFrame, Panel 클래스 제공
- index는 미작성시 자동 생성(0~)
- 시리즈(Series) : 1차원 배열 구조 index + value(핵심요소) 
    - 생성 pd.Series(list..), __pd.Series(dict):key가 자동으로 index가 됨__
    - 속성 
        - values(값보기), .index(인덱스보기), .name(.index.name)(이름짓기), .dtype(d배열 타입보기)  
        - .isnotnull(비교연산후 유용), .isnull
    - 기본 연산 가능 - 연산결과의 타입은 유지(Series)
    - 인덱싱 : [index]/['index'], 다중인덱싱[[ ]]- index가 무조건 따라옴 -> [[ ]].values하면 해결!!
        - 불리언 인덱싱 ok. 조건식 두개 이상일 때 괄호 넣자! -> 값만 넣어도 됨
        - df.loc[(1,'female'),'Age']
    - __슬라이싱 : 인덱스이름으로 슬라이싱 할 때는 '미만'개념이 없다!__
    - 추가, 수정, 삭제 : 인/슬 = 값 , del 인/슬
- 데이터프레임(DataFrame)
    - 2차원 리스트를 매개변수로 전달. 즉 행과 열을 가지는 자료구조 
    - 열(columns), 인덱스(index), 값(values)으로 구성
    - 생성 pd.DataFrame(list..), __pd.DataFrame(dict):바깥 key가 col로__
        - df2 = pd.DataFrame(data4, index = ind, columns = col)
        - 리스트(List), 시리즈(Series), 딕셔너리(dict), Numpy의 ndarrays, 또 다른 데이터프레임으로 생성
        - 다양한 방법으로 생성가능
    - 속성
        - .T(행열 바꾸기. Transposition)
        - .values, .index, __.columns__
        - 조회 속성(행기준)
            - df.head(n) - 앞 부분을 n개만 보기
            - df.tail(n) - 뒷 부분을 n개만 보기
    - 함수 : __axis=0,1,2 의 활용!!__
        - .sum(), mean(), max(), min(), ...
        - .isnull(), .notnull()
        - .sort_index(), .sort_values(col,ascending=False)
        - .apply(함수이름만?) : 함수의 적용 
        - .value_counts() : 어떤 값들이 몇 번 나왔는지 
        - .fillna(x) : NaN값을 x로 대체
        - pd.cut(배열데이터, bins(범주값), labels=범주명배열)   __범주값 '초과 ~ 이하' 임에 유의!!__
        - concat([df1, df2], keys=[ ], axis= , join='none'/'inner', ignore_index=none/True)
    - 인덱싱 및 슬라이싱(속성) : 번호나 이름으로 인/슬 하는 것도 boolean index와 원리가 다르지 않다. true값만 가져오기  
        - [only one] Series 형태로 출력, [[only one]] DataFrame 형태로 출력
        - 기본 
            - 인덱싱(열) : df.[[열1,열2]] 
            - 슬라이싱(행) : df.[i:i] 또는 df.[in:in]  
        - 행열단위(분절된 행렬선택이 가능!!)
            - .loc(행이름, 열이름) &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - 인덱싱([[ , ],[ , ]]), ([ , ])
            - .iloc(행번호, 열번호) &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - 슬라이싱([ : , : ])
            - .loc[ ], .iloc[ ] -> 행이 우선이니 행을 넣어줘야함
            - __행추가시 이름을 쓰는 .loc를 사용해야함.__ iloc cannot enlarge its target object
        - 다중인덱싱 : 인덱스가 여러개인 경우 loc를 사용해 index값으로 쉽게 인덱싱 할 수 있다.
            - ex)df.loc[(2,'female'),'Age':] 인덱스의 경우 key값이므로 (튜플)로 넣어준다. 첫번째 인덱스만 검색할 수 있지만, 두번째 인덱스만 검색하는 것은 불가.
        - boolean 
    - pandas 출력 행/열 개수 조정
        - 현재화면
            - pd.options.display.max_rows=10
            - pd.options.display.max_columns=10
        - 기본 속성 변경
            - pd.set_option('display.max_columns',None)
            - pd.set_option('display.max_rows',None)
    - pandas 실수 자릿수 설정
        - 현재 화면 : pd.options.display.float_format = '{:.2f}'.format
        - 기본 속성 : pd.set_option('display.float_format','{:.2f}'.format) 항상

In [5]:
import pandas as pd

In [6]:
pd.set_option('display.float_format','{:.2f}'.format)

In [7]:
pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',15)

In [8]:

population = pd.Series([9904312, 3448737, 2890451, 2466052])
population

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64

In [206]:
# Series 생성시 인덱스 지정하기
population = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울','부산','인천','대구'])
population

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [207]:
# Series의 값만 확인
print(population.values)
# Series의 인덱스만 확인
print(population.index)
# Series의 데이터value 타입 확인하기 (인덱스타입x)
print(population.dtype)

[9904312 3448737 2890451 2466052]
Index(['서울', '부산', '인천', '대구'], dtype='object')
int64

In [210]:
# Series에 이름 지정하기
population.name = '인구'
population.index.name= '도시'
#population.values.name='인구수' 불가 (왜냐면 시리즈의 이름이 value의 이름)
population

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [302]:
a="blue"
b=a


list1=[1,2,3]
print(hash(a))
print(hash(b))

631732939183922477
631732939183922477

In [12]:
df=pd.DataFrame(population)
df

         0
0  9904312
1  3448737
2  2890451
3  2466052

In [17]:
pd.DataFrame(data=df, index:[5,6,7,8])

SyntaxError: invalid syntax (<ipython-input-17-b25ecb414ced>, line 1)

In [209]:
#인덱싱 - 번호(요소순서), 실제 이름 모두 가능
print(population[1])
print(population['부산'])
print(population[[0,3,1]])   # 다중 인덱싱에서 index는 뗄 수 없다.!!
print(population[['서울','대구','부산']])

3448737
3448737
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [7]:
# 불리언 인덱싱
population>=2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [8]:
# 값을 보고 싶다면 원래 시리즈에 담아서 인덱싱해버려
population[population>=2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [9]:
population[(2500000<=population)&(population<=5000000)] # 괄호 유의
#왜 안되지?population[(2500000<=population<=5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [10]:
# 전체 데이터에서 부산, 인천 -> 슬라이싱 사용
print(population[1:3])
print(population['부산':'인천'])

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

#### dict자료 구조 활용해서 Series 생성하기

In [11]:
#포케몬이름 : 능력치
data = {'피카츄':9631, '꼬부기':3393, '파이리':1490, '이상해씨':2632}
pokemon = pd.Series(data)
pokemon

피카츄     9631
꼬부기     3393
파이리     1490
이상해씨    2632
dtype: int64

In [12]:
#레벨업한 데이터가 들어있는 pokemon_up Series
data2 = {'피카츄':9904, '꼬부기':3448, '이브이':2466, '뮤':2890}
pokemon_up = pd.Series(data2)
pokemon_up

피카츄    9904
꼬부기    3448
이브이    2466
뮤      2890
dtype: int64

In [13]:
attack = pokemon_up-pokemon
attack
# 키값이 다른 경우 NaN(null)으로 나온다.

꼬부기      55.0
뮤         NaN
이브이       NaN
이상해씨      NaN
파이리       NaN
피카츄     273.0
dtype: float64

In [14]:
#비어있지 않은 데이터들만 보고 싶다면? 비어있는것만? .notnull, .isnull
attack.notnull()

꼬부기      True
뮤       False
이브이     False
이상해씨    False
파이리     False
피카츄      True
dtype: bool

In [15]:
attack[attack.notnull()]

꼬부기     55.0
피카츄    273.0
dtype: float64

In [16]:
attack[attack  > 100 ]

피카츄    273.0
dtype: float64

In [17]:
# Series 데이터 수정, 추가, 삭제 
pokemon['피카츄':'파이리'] = 1616  # 기존 거는 덮어씌워지고
pokemon['리자몽'] = 8888   # 새로운 거는 추가되고
del pokemon['파이리']      # del 인덱싱
pokemon

피카츄     1616
꼬부기     1616
이상해씨    2632
리자몽     8888
dtype: int64

### DataFrame
---------------------------

In [18]:
#dict 자료구조 활용해서 dataframe 생성하기
data3 = {'2015':[9904312, 3448737,2890451,2466052], '2010':[9631482,3393191,2632035,2431774]}
data3

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [19]:
df = pd.DataFrame(data3)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [20]:
#데이터프레임 인덱스 명칭 바꾸기
df.index = ['서울','부산','인천','대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [21]:
# 인덱스와 컬럼명 따로 생성하기
data4 = [[9904312, 3448737,2890451,2466052],[9631482,3393191,2632035,2431774]]
ind = ['2015','2010']
col = ['서울','부산','인천','대구']
df2 = pd.DataFrame(data4, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [22]:
# 딕셔너리를 넣기
score_dic = {'나효주' : {'수학':100, '영어':100, '과학':50},
            '정명은' : {'영어':80,'과학':100,'수학':95},
            '김영웅':{'과학':70,'수학':50,'영어':60}}

In [23]:
df3 = pd.DataFrame(score_dic)
df3

    나효주  정명은  김영웅
수학  100   95   50
영어  100   80   60
과학   50  100   70

In [24]:
# 프레임 바꾸기 .T
df3.T

      수학   영어   과학
나효주  100  100   50
정명은   95   80  100
김영웅   50   60   70

In [25]:
print(df2.values)   # 값만 확인하기
print(df2.index)   # 인덱스만 확인하기
print(df2.columns)   # 컬럼만 확인하기

[[9904312 3448737 2890451 2466052]
 [9631482 3393191 2632035 2431774]]
Index(['2015', '2010'], dtype='object')
Index(['서울', '부산', '인천', '대구'], dtype='object')

### 데이터프레임 인덱싱 & 슬라이싱

- 유의사항 다시한번
    - 기본 조회시 인덱싱-열, 슬라이싱-행
    - 하나의 축만 조회할 경우, 시리즈 형태로 출력할지 df로 출력할지
    - 이름은 미만 개념 없음
    - 행열단위 속성시 , : 기호 유의

In [26]:
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [27]:
df.iloc[:,0:] # 열이름으로 인덱싱 하면 Series형태로 가져오게 됨

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [28]:
df[['2015']] #  dataframe형태로 가져오게 됨

       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052

In [29]:
df['2005'] = [9762546,3512547,2517680,2456016] #대괄호 한 번 쓰나 두번 쓰나 결과 같다.
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [30]:
# 인덱싱 번호로 행단위 슬라이싱 
df[0:2]
df['서울':'인천']

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [31]:
df.loc[['부산' , '인천'], '2015': '2010']

       2015     2010
부산  3448737  3393191
인천  2890451  2632035

In [32]:
df.iloc[[1,3],0:2]

       2015     2010
부산  3448737  3393191
대구  2466052  2431774

In [33]:
print(df.iloc[[0]])
print()
print(df.iloc[0])
print()
print(df.iloc[0:1,0:1])

       2015     2010     2005
서울  9904312  9631482  9762546

2015    9904312
2010    9631482
2005    9762546
Name: 서울, dtype: int64

       2015
서울  9904312

정렬하기

In [34]:
population = pd.read_csv('population_number.csv', index_col='도시', encoding='euc-kr',)
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [35]:
# 정렬하기 
population.sort_index()   #() 빼면 안 됨!!!

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [36]:
# 2010년도 데이터 값을 기준으로 정렬하기, 역순으로 정렬하기
population.sort_values('2010', ascending = False)   #(by = '2010')이 온전한 형태

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [37]:
# 정렬기준 2개 이상 -> 리스트형태 활용
population.sort_values(['지역','2010'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

-----------------

In [38]:
score = pd.read_csv('score.csv', index_col = '과목', encoding='euc-kr')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [39]:
#학급별 점수 총합 및 순위(역순정렬)
score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [40]:
#과목별 점수 총합
score.sum(axis=1)

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [41]:
#과목별 '합계' 컬럼을 추가
score['합계']=score.sum(axis=1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [42]:
#01. 과목별 평균 계산 '평균'컬럼 추가
score['평균']=score.iloc[:,:4].mean(axis=1)
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [43]:
# 반 평균 행 추가 
score.loc['반평균']=score.mean()
score

       1반    2반    3반    4반     합계     평균
과목
파이썬  45.0  44.0  73.0  39.0  201.0  50.25
DB   76.0  92.0  45.0  69.0  282.0  70.50
자바   47.0  92.0  45.0  69.0  253.0  63.25
크롤링  92.0  81.0  85.0  40.0  298.0  74.50
Web  11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [44]:
# 과목별 가장 높은 점수, =maxScore
maxScore = score.iloc[:5,:4].max(axis=1)
# 가장 낮은 점수 
minScore = score.iloc[:5,:4].min(axis=1)
# max - min
maxScore - minScore

과목
파이썬    34.0
DB     47.0
자바     47.0
크롤링    52.0
Web    68.0
dtype: float64

apply 함수
- 행 or 열단위로 복잡한 함수를 사용하고 싶을 때 적용
-

In [45]:
# 큰 값에서작은값을 빼주는 우리만의 함수 max_min생성
def max_min(x):
    return x.max() - x.min()

In [46]:
score.loc[:'Web',:'4반'].apply(max_min, axis =1)

과목
파이썬    34.0
DB     47.0
자바     47.0
크롤링    52.0
Web    68.0
dtype: float64

In [47]:
df=pd.DataFrame({'A':[1,3,3,4,4],
                'B':[1,2,2,3,3],
                'C':[1,2,4,4,5]})
df

#데이터프레임 또는 시리즈 안에 특정 값이 몇 번 들어가 있는지 확인하기
df['A'].value_counts()
#apply함수 사용해서 value_counts기능 사용해보기
df2=df.apply(pd.value_counts)
df2

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [48]:
#NaN 즉 결측치 값이 존재할 때 해당하는 값을 원하는 값으로 대체하기
df2.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 카테고리 생성하기

In [49]:
#나이 데이터로 카테고리 생성
#1. 데이터
ages = [0,2,10,15,19,23,37,61,20,41,100,32]
#2. bins(범주)
bins = [-1,19,35,60,100] # 초과 ~이하 <  <=
#3. 카테고리 범주의 명칭
labes = ['미성년자','청년','중년','노년']
#4. 데이터배열과 매칭되는 카테고리 배열 생성하기
cat = pd.cut(ages,bins,labels=labes)
print(type(cat))
print(cat.categories)
cat

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '중년', '노년'], dtype='object')

['미성년자', '미성년자', '미성년자', '미성년자', '미성년자', ..., '노년', '청년', '중년', '노년', '청년']
Length: 12
Categories (4, object): ['미성년자' < '청년' < '중년' < '노년']

In [50]:
# ages 데이터 데이터프레임 생성
age_df = pd.DataFrame(ages, columns=['ages'])
age_df['카테고리'] = cat
age_df
# 카테고리별로 나이 개수 확인하기
age_df['카테고리'].value_counts()

미성년자    5
청년      3
중년      2
노년      2
Name: 카테고리, dtype: int64

### 데이터프레임 병합하기  
- concat([df1, df2], keys=[ ], axis= , join='none'/'inner', ignore_index=none/True)

In [51]:
df1 = pd.DataFrame({'A':['AO','A1','A2','A3'],
                   'B':['BO','B1','B2','B3'],
                    'C':['C0','C1','C2','C3']
                   }, index = [0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7']
                   }, index = [4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11']
                   }, index = [8,9,10,11])

In [52]:
# 다중 인덱스 부여하기(계층적으로 데이터 관리)
# keys 값은 df개수에 맞게. keys가 적으면 df 짤림
pd.concat([df1,df2,df3], keys = ['x','y','z'])

        A    B    C
x 0    AO   BO   C0
  1    A1   B1   C1
  2    A2   B2   C2
  3    A3   B3   C3
y 4    A4   B4   C4
  5    A5   B5   C5
  6    A6   B6   C6
  7    A7   B7   C7
z 8    A8   B8   C8
  9    A9   B9   C9
  10  A10  B10  C10
  11  A11  B11  C11

In [53]:
# full join : 인덱스를 기준으로 일치하지 않으면 nan값넣어서 (A U B) 형태로
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                   'D':['D2','D3','D6','D7'],
                   'F':['F2','F3','F6','F7']
                   }, index = [2,3,6,7])
pd.concat([df1,df4], axis=1)

     A    B    C    B    D    F
0   AO   BO   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2   B2   D2   F2
3   A3   B3   C3   B3   D3   F3
6  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN   B7   D7   F7

In [54]:
# inner join : 인덱스를 기준으로 일치하는 값들만.. (A ∩ B) 형태로
pd.concat([df1,df4], axis=1, join='inner')

    A   B   C   B   D   F
2  A2  B2  C2  B2  D2  F2
3  A3  B3  C3  B3  D3  F3

In [55]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                   'D':['D2','D3','D6','D7'],
                   'F':['F2','F3','F6','F7']
                   }, index = [2,3,6,7])
pd.concat([df1,df4], ignore_index=True) #axis =1 을 넣으면 원래 col 지우고 자동 colindex

     A   B    C    D    F
0   AO  BO   C0  NaN  NaN
1   A1  B1   C1  NaN  NaN
2   A2  B2   C2  NaN  NaN
3   A3  B3   C3  NaN  NaN
4  NaN  B2  NaN   D2   F2
5  NaN  B3  NaN   D3   F3
6  NaN  B6  NaN   D6   F6
7  NaN  B7  NaN   D7   F7

- merge(df1, df2)

In [56]:
df5 = pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']
                   })
df6 = pd.DataFrame({'key':['K0','K2','K3','K4'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']
                   })

In [57]:
pd.merge(df5,df6)   # axis= 넣으면 오류. 
# 중복 칼럼명이 하나밖에 없으면 on='key'넣으나 안 넣으나 결과 동일한 innerjoin
# 중복 칼럼명이 둘 이상일 때는 on='기준col'이 필수
# 중복 칼럼명이 없으면 실행 불가
# Series 병합 불가능

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C1  D1
2  K3  A3  B3  C2  D2

In [58]:
df1=pd.merge(df5,df6, on='key')
df1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C1  D1
2  K3  A3  B3  C2  D2

In [59]:
#내가 원하는 행 데이터 삭제하기
df1.drop([0])

  key   A   B   C   D
1  K2  A2  B2  C1  D1
2  K3  A3  B3  C2  D2

In [308]:
#전년대비 지역별 범죄 증감율 = (금년-작년)/작년 *100
crime_2015 = pd.read_csv('2015.csv', index_col='관서명', encoding='euc-kr')
crime_2016 = pd.read_csv('2016.csv', index_col='관서명', encoding='euc-kr',)
crime_2017 = pd.read_csv('2017.csv', index_col='관서명', encoding='euc-kr',)
crime_2017

            구분  살인  강도  강간·강제추행    절도     폭력
관서명
광주지방경찰청계  발생건수   9  33      725  4816   8366
광주지방경찰청계  검거건수   9  32      732  3487   7553
광주지방경찰청계  검거인원  10  61      824  3046  11018
광주지방경찰청계    구속   8  28       71   115     88
광주지방경찰청계   불구속   0  26      523  2493   5235
...        ...  ..  ..      ...   ...    ...
광주광산경찰서   검거건수   3  10      144   660   1702
광주광산경찰서   검거인원   3  22      148   594   2390
광주광산경찰서     구속   3  11        6    25     18
광주광산경찰서    불구속   0   7      102   515   1104
광주광산경찰서     기타   0   4       40    54   1268

[42 rows x 6 columns]

In [61]:
# 연도별 관서별 발생건수 
count2015 = crime_2015[crime_2015['구분']=='발생건수'].sum(axis=1)
count2016 = crime_2016[crime_2016['구분']=='발생건수'].sum(axis=1)
count2017 = crime_2017[crime_2017['구분']=='발생건수'].sum(axis=1)

count = pd.DataFrame([count2015,count2016,count2017], index=['2015총계','2016총계','2017총계']).T
count
count_all = count.drop(['광주지방경찰청'])
count_all

           2015총계   2016총계   2017총계
관서명
광주지방경찰청계  18830.0  15416.0  13949.0
광주동부경찰서    2355.0   2068.0   1799.0
광주서부경찰서    4720.0   3892.0   3638.0
광주남부경찰서    2117.0   1865.0   1547.0
광주북부경찰서    5466.0   4148.0   3945.0
광주광산경찰서    4172.0   3443.0   3020.0

In [62]:
count_all['2016증감률']=(count_all['2016총계']-count_all['2015총계'])*100/count_all['2015총계']
count_all['2017증감률']=(count_all['2017총계']-count_all['2016총계'])*100/count_all['2016총계']
count_all

           2015총계   2016총계   2017총계    2016증감률    2017증감률
관서명
광주지방경찰청계  18830.0  15416.0  13949.0 -18.130643  -9.516087
광주동부경찰서    2355.0   2068.0   1799.0 -12.186837 -13.007737
광주서부경찰서    4720.0   3892.0   3638.0 -17.542373  -6.526208
광주남부경찰서    2117.0   1865.0   1547.0 -11.903637 -17.050938
광주북부경찰서    5466.0   4148.0   3945.0 -24.112697  -4.893925
광주광산경찰서    4172.0   3443.0   3020.0 -17.473634 -12.285797

In [63]:
values = [[1, 2, 3], [4, 5, 6], [7, 8, 9,10]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C','d']

df = pd.DataFrame(values, index=index, columns=columns)
print(df)

       A  B  C     d
one    1  2  3   NaN
two    4  5  6   NaN
three  7  8  9  10.0